gap Скопировать ссылку "gap"
С помощью этого свойства можно с лёгкостью задавать отступы между строками и столбцами.

Является краткой записью свойств &
row-gap и 
column-gap.

Может иметь одно или два значения. Если указано только одно, то column-gap автоматически равен row-gap. Если указаны два значения, то первое будет задавать отступы между рядами (row-gap), а второе — между колонками (column-gap).

Значения можно указывать в любых доступных единицах измерения, включая проценты.
Допускается использование функции calc().

.container {
  display: flex;
  gap: 30px calc(10rem - 10px);
}
